TDPortal/Utilities/ExposedServicesTestTool/ExposedServicesTestToolClient/Requests/CycleJourneyPlannerSynchronous/V1/PlanCycleJourney - Coordinates Bad Coords.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
	<PlanCycleJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.CycleJourneyPlannerSynchronous.V1">
      <transactionId>testCycleJourneyPlanner</transactionId>
      <request>
        <JourneyRequest>
          <JourneyRequestId>01</JourneyRequestId>
          <OriginLocation>
            <Description>Origin Coordinate</Description>
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>621700</Easting>
				<Northing>30620200</Northing>
			</GridReference>
          </OriginLocation>
          <DestinationLocation>
            <Description>Destination Coordinate</Description>
			<Type>Coordinate</Type>
			<GridReference>
				<Easting>622700</Easting>
				<Northing>309102</Northing>
			</GridReference>
          </DestinationLocation>
          <OutwardDateTime>2012-11-29T09:00:00.0000+01:00</OutwardDateTime>
          <OutwardArriveBefore>false</OutwardArriveBefore>
        </JourneyRequest>
      </request>
    </PlanCycleJourney>
  </soap:Body>
</soap:Envelope>